In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
data=pd.read_csv("ds_salaries.csv")

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   salary_currency     3755 non-null   object
 6   salary_in_usd       3755 non-null   int64
 7   employee_residence  3755 non-null   object
 8   remote_ratio        3755 non-null   int64
 9   company_location    3755 non-null   object
 10  company_size        3755 non-null   object
dtypes: int64(4), object(7)
memory usage: 322.8+ KB

In [5]:
data.describe()

         work_year        salary  salary_in_usd  remote_ratio
count  3755.000000  3.755000e+03    3755.000000   3755.000000
mean   2022.373635  1.906956e+05  137570.389880     46.271638
std       0.691448  6.716765e+05   63055.625278     48.589050
min    2020.000000  6.000000e+03    5132.000000      0.000000
25%    2022.000000  1.000000e+05   95000.000000      0.000000
50%    2022.000000  1.380000e+05  135000.000000      0.000000
75%    2023.000000  1.800000e+05  175000.000000    100.000000
max    2023.000000  3.040000e+07  450000.000000    100.000000

In [9]:
data.corr(numeric_only = True)

               work_year    salary  salary_in_usd  remote_ratio
work_year       1.000000 -0.094724       0.228290     -0.236430
salary         -0.094724  1.000000      -0.023676      0.028731
salary_in_usd   0.228290 -0.023676       1.000000     -0.064171
remote_ratio   -0.236430  0.028731      -0.064171      1.000000

In [11]:
column_names=data.columns
column_names

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [12]:
data.isna().sum()

work_year             0
experience_level      0
employment_type       0
job_title             0
salary                0
salary_currency       0
salary_in_usd         0
employee_residence    0
remote_ratio          0
company_location      0
company_size          0
dtype: int64

In [14]:
data.sample(5)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
3012,2022,SE,FT,Machine Learning Engineer,193900,USD,193900,US,0,US,M
3287,2022,SE,FT,Data Architect,90700,USD,90700,CA,100,CA,M
2388,2022,SE,FT,Data Analyst,130000,USD,130000,US,0,US,M
2283,2022,SE,FT,Data Scientist,168000,USD,168000,US,100,US,M
141,2023,EN,FT,Data Analyst,75000,USD,75000,US,0,US,M

In [37]:
[(f"{i}:",data[i].unique()) for i in column_names if data[i].dtype==object]

[('experience_level:', array(['SE', 'MI', 'EN', 'EX'], dtype=object)),
 ('employment_type:', array(['FT', 'CT', 'FL', 'PT'], dtype=object)),
 ('job_title:',
  array(['Principal Data Scientist', 'ML Engineer', 'Data Scientist',
         'Applied Scientist', 'Data Analyst', 'Data Modeler',
         'Research Engineer', 'Analytics Engineer',
         'Business Intelligence Engineer', 'Machine Learning Engineer',
         'Data Strategist', 'Data Engineer', 'Computer Vision Engineer',
         'Data Quality Analyst', 'Compliance Data Analyst',
         'Data Architect', 'Applied Machine Learning Engineer',
         'AI Developer', 'Research Scientist', 'Data Analytics Manager',
         'Business Data Analyst', 'Applied Data Scientist',
         'Staff Data Analyst', 'ETL Engineer', 'Data DevOps Engineer',
         'Head of Data', 'Data Science Manager', 'Data Manager',
         'Machine Learning Researcher', 'Big Data Engineer',
         'Data Specialist', 'Lead Data Analyst', 'BI Data Engineer',
         'Director of Data Science', 'Machine Learning Scientist',
         'MLOps Engineer', 'AI Scientist', 'Autonomous Vehicle Technician',
         'Applied Machine Learning Scientist', 'Lead Data Scientist',
         'Cloud Database Engineer', 'Financial Data Analyst',
         'Data Infrastructure Engineer', 'Software Data Engineer',
         'AI Programmer', 'Data Operations Engineer', 'BI Developer',
         'Data Science Lead', 'Deep Learning Researcher', 'BI Analyst',
         'Data Science Consultant', 'Data Analytics Specialist',
         'Machine Learning Infrastructure Engineer', 'BI Data Analyst',
         'Head of Data Science', 'Insight Analyst',
         'Deep Learning Engineer', 'Machine Learning Software Engineer',
         'Big Data Architect', 'Product Data Analyst',
         'Computer Vision Software Engineer', 'Azure Data Engineer',
         'Marketing Data Engineer', 'Data Analytics Lead', 'Data Lead',
         'Data Science Engineer', 'Machine Learning Research Engineer',
         'NLP Engineer', 'Manager Data Management',
         'Machine Learning Developer', '3D Computer Vision Researcher',
         'Principal Machine Learning Engineer', 'Data Analytics Engineer',
         'Data Analytics Consultant', 'Data Management Specialist',
         'Data Science Tech Lead', 'Data Scientist Lead',
         'Cloud Data Engineer', 'Data Operations Analyst',
         'Marketing Data Analyst', 'Power BI Developer',
         'Product Data Scientist', 'Principal Data Architect',
         'Machine Learning Manager', 'Lead Machine Learning Engineer',
         'ETL Developer', 'Cloud Data Architect', 'Lead Data Engineer',
         'Head of Machine Learning', 'Principal Data Analyst',
         'Principal Data Engineer', 'Staff Data Scientist',
         'Finance Data Analyst'], dtype=object)),
 ('salary_currency:',
  array(['EUR', 'USD', 'INR', 'HKD', 'CHF', 'GBP', 'AUD', 'SGD', 'CAD',
         'ILS', 'BRL', 'THB', 'PLN', 'HUF', 'CZK', 'DKK', 'JPY', 'MXN',
         'TRY', 'CLP'], dtype=object)),
 ('employee_residence:',
  array(['ES', 'US', 'CA', 'DE', 'GB', 'NG', 'IN', 'HK', 'PT', 'NL', 'CH',
         'CF', 'FR', 'AU', 'FI', 'UA', 'IE', 'IL', 'GH', 'AT', 'CO', 'SG',
         'SE', 'SI', 'MX', 'UZ', 'BR', 'TH', 'HR', 'PL', 'KW', 'VN', 'CY',
         'AR', 'AM', 'BA', 'KE', 'GR', 'MK', 'LV', 'RO', 'PK', 'IT', 'MA',
         'LT', 'BE', 'AS', 'IR', 'HU', 'SK', 'CN', 'CZ', 'CR', 'TR', 'CL',
         'PR', 'DK', 'BO', 'PH', 'DO', 'EG', 'ID', 'AE', 'MY', 'JP', 'EE',
         'HN', 'TN', 'RU', 'DZ', 'IQ', 'BG', 'JE', 'RS', 'NZ', 'MD', 'LU',
         'MT'], dtype=object)),
 ('company_location:',
  array(['ES', 'US', 'CA', 'DE', 'GB', 'NG', 'IN', 'HK', 'NL', 'CH', 'CF',
         'FR', 'FI', 'UA', 'IE', 'IL', 'GH', 'CO', 'SG', 'AU', 'SE', 'SI',
         'MX', 'BR', 'PT', 'RU', 'TH', 'HR', 'VN', 'EE', 'AM', 'BA', 'KE',
         'GR', 'MK', 'LV', 'RO', 'PK', 'IT', 'MA', 'PL', 'AL', 'AR', 'LT',
         'AS', 'CR', 'IR', 'BS', 'HU', 'AT', 'SK', 'CZ', 'TR', 'PR', 'DK',
         'BO', 'PH', 'BE', 'ID', 'EG', 'AE', 'LU', 'MY', 'HN', 'JP', 'DZ',
         'IQ', 'CN', 'NZ', 'CL', 'MD', 'MT'], dtype=object)),
 ('company_size:', array(['L', 'S', 'M'], dtype=object))]

In [20]:
isinstance(data["company_size"],object )

True

In [33]:
data["salary"].dtype

dtype('int64')